Ran Plan for 5 projects:

1. dir: `bruno-athaide-product-test/poc-config-v3` workspace: `default`
1. dir: `bruno-athaide-product-test/poc-config-v3/forno` workspace: `default`
1. dir: `bruno-athaide-product-test/poc-config-v3/prod` workspace: `default`
1. dir: `bruno-athaide-product-test/segments` workspace: `default`
1. dir: `bruno-athaide-product-test/shared` workspace: `default`
---

### 1. dir: `bruno-athaide-product-test/poc-config-v3` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 0s [id=1756143431]
data.configcat_environments.prod_environment: Reading...
data.configcat_environments.prod_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756143431]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "POC Config V3 description - testing"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "POC Config V3"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ config_id  = (known after apply)
+ product_id = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v3
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v3%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v3
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `bruno-athaide-product-test/poc-config-v3/forno` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/opt/homebrew/bin/terraform init -input=false -upgrade' in '/Users/caio.queiroz/.atlantis/repos/caioq/poc-configcat-atlantis/4/default/bruno-athaide-product-test/poc-config-v3/forno': exit status 1

Initializing the backend...
Upgrading modules...
- parent_config in ..
- parent_config.shared in ../../shared

Initializing provider plugins...
- Finding latest version of hashicorp/configcat...
- Finding configcat/configcat versions matching "~> 5.0"...
- Installing configcat/configcat v5.5.7...
- Installed configcat/configcat v5.5.7 (self-signed, key ID 7C7CA631F7D7DAD7)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
╷
│ Error: Failed to query available provider packages
│ 
│ Could not retrieve the list of available versions for provider
│ hashicorp/configcat: provider registry registry.terraform.io does not have
│ a provider named registry.terraform.io/hashicorp/configcat
│ 
│ Did you intend to use configcat/configcat? If so, you must specify that
│ source address in each module which requires that provider. To see which
│ modules are currently depending on hashicorp/configcat, run the following
│ command:
│     terraform providers
╵


```
</details>

---
### 3. dir: `bruno-athaide-product-test/poc-config-v3/prod` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/opt/homebrew/bin/terraform init -input=false -upgrade' in '/Users/caio.queiroz/.atlantis/repos/caioq/poc-configcat-atlantis/4/default/bruno-athaide-product-test/poc-config-v3/prod': exit status 1

Initializing the backend...
Upgrading modules...
- parent_config in ..
- parent_config.shared in ../../shared
- segments in ../../segments
- segments.shared in ../../shared

Initializing provider plugins...
- Finding configcat/configcat versions matching "~> 5.0"...
- Finding latest version of hashicorp/configcat...
- Installing configcat/configcat v5.5.7...
- Installed configcat/configcat v5.5.7 (self-signed, key ID 7C7CA631F7D7DAD7)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
╷
│ Error: Failed to query available provider packages
│ 
│ Could not retrieve the list of available versions for provider
│ hashicorp/configcat: provider registry registry.terraform.io does not have
│ a provider named registry.terraform.io/hashicorp/configcat
│ 
│ Did you intend to use configcat/configcat? If so, you must specify that
│ source address in each module which requires that provider. To see which
│ modules are currently depending on hashicorp/configcat, run the following
│ command:
│     terraform providers
╵


```
</details>

---
### 4. dir: `bruno-athaide-product-test/segments` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 0s [id=1756143442]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_segment.beta_users will be created
+ resource "configcat_segment" "beta_users" {
      + comparator           = "sensitiveIsOneOf"
      + comparison_attribute = "email"
      + comparison_value     = "betauser1@example.com,betauser2@example.com"
      + description          = "Beta users' description"
      + id                   = (known after apply)
      + name                 = "Beta users"
      + product_id           = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ beta_users_segment_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/segments
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fsegments%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/segments
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 5. dir: `bruno-athaide-product-test/shared` workspace: `default`
```diff
Changes to Outputs:
+ product_name = "Bruno Athaide Product Test"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/shared
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fshared%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/shared
  ```

---
### Plan Summary

5 projects, 3 with changes, 0 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```